# GetExternalResourceReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkLoadResult..::..GetExternalResourceReference Method
LinkLoadResult Class See Also
---
Gets a copy of the ExternalResourceReference corresponding to the link.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ExternalResourceReference GetExternalResourceReference()
```

Visual Basic
---
```text
Public Function GetExternalResourceReference As ExternalResourceReference
```

Visual C++
---
```text
public:
ExternalResourceReference^ GetExternalResourceReference()
```

# ### Return Value
A copy of the ExternalResourceReference corresponding to the link.
# See Also
LinkLoadResult Class
Autodesk.Revit.DB Namespace